In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})

In [3]:
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [4]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})

In [5]:
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [8]:
uk_weather = pd.DataFrame({
    "city": ["Liverpool","Manchester","London"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})

In [9]:
uk_weather

         city  temperature  humidity
0   Liverpool           21        68
1  Manchester           14        65
2      London           35        75

In [6]:
newdata = pd.concat([india_weather, us_weather])
newdata

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
newdata = pd.concat([india_weather, us_weather], ignore_index= True)
newdata

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [10]:
newdata = pd.concat([india_weather, us_weather, uk_weather], ignore_index=True)
newdata

         city  temperature  humidity
0      mumbai           32        80
1       delhi           45        60
2    banglore           30        78
3    new york           21        68
4     chicago           14        65
5     orlando           35        75
6   Liverpool           21        68
7  Manchester           14        65
8      London           35        75

In [13]:
newdata = pd.concat([india_weather, us_weather, uk_weather],keys= ["India", "U.S.", "United Kingdom"])
newdata

                        city  temperature  humidity
India          0      mumbai           32        80
               1       delhi           45        60
               2    banglore           30        78
U.S.           0    new york           21        68
               1     chicago           14        65
               2     orlando           35        75
United Kingdom 0   Liverpool           21        68
               1  Manchester           14        65
               2      London           35        75

In [15]:
newdata.loc["U.S."]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [16]:
newdata.loc["United Kingdom"]

         city  temperature  humidity
0   Liverpool           21        68
1  Manchester           14        65
2      London           35        75

In [17]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[4,5,2])
temperature_df

       city  temperature
4    mumbai           32
5     delhi           45
2  banglore           30

In [18]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [19]:
df = pd.concat([temperature_df,windspeed_df])
df

       city  temperature  windspeed
4    mumbai         32.0        NaN
5     delhi         45.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0

In [20]:
df = pd.concat([temperature_df,windspeed_df], axis= 1)
df

       city  temperature    city  windspeed
4    mumbai         32.0     NaN        NaN
5     delhi         45.0     NaN        NaN
2  banglore         30.0     NaN        NaN
1       NaN          NaN   delhi        7.0
0       NaN          NaN  mumbai       12.0

In [21]:
s = pd.Series(["Humid","Dry","Rain"], name="event")

In [22]:
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [27]:
df = pd.concat([df,s],axis = 1 )
df

       city  temperature    city  windspeed  event  event  event  event
4    mumbai         32.0     NaN        NaN    NaN    NaN    NaN    NaN
5     delhi         45.0     NaN        NaN    NaN    NaN    NaN    NaN
2  banglore         30.0     NaN        NaN   Rain   Rain   Rain   Rain
1       NaN          NaN   delhi        7.0    Dry    Dry    Dry    Dry
0       NaN          NaN  mumbai       12.0  Humid  Humid  Humid  Humid

In [ ]:
df.drop("event", ax)